{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45663928",
    "collection_date": "2024-11-23",
    "deadline": "상시채용",
    "search": "데이터 엔지니어",
    "company": "번개장터",
    "post title": "번개장터\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\n[번개장터] Backend Software Engineer",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45663928?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=1027",
    "image": [],
    "text": "[번개장터]\nBackend Software Engineer\n번개장터를 소개해요\n옷장 깊숙한 곳에 놓인 재킷\n먼지 쌓인 태블릿 PC\n더 이상 손이 가지 않는 명품 지갑\n지금도 번개장터에서는 이 모든 물건들이 재발견되어 누군가의 새로운 가치가 됩니다.\n\n번개장터는 오늘도 ‘세상 모든 물건에 가치를, 소비를 지속 가능하게‘라는 비전 아래, 스트레스 프리 중고거래(리커머스) 경험을 선사하는 사용자 중심 서비스를 만들어 나가고 있습니다.\n이제는 소비의 한 장르가 되어버린 중고거래. C2C 리커머스의 미래를 치열하게 고민하고 그 희열을 함께 나누고 싶은 분이라면 번개장터에서 새로운 시작을 맞이해 보세요.\n\n합류하게 될 팀을 소개해요\n번개장터 서비스에서의 사용자 경험을 극대화 하기 위해 필요한 다양한 백엔드 콤포넌트 개발을 담당해요.\n대용량 트래픽을 비용 효율적으로 안정적으로 제공하기 위해 다양한 업무를 수행해요. \n상품 리스팅, 검색, 번개톡, 주문, 결제, 배송, 사기 탐지 등 구매자, 판매자의 구매/판매 경험을 자연스럽고 안전하게 만들기 위한 모든 기능을 담당하여 개발해요. \nC2C 거래 뿐만 아니라 커머스에서 필수적으로 필요한 도메인을 경험하고 본인의 커리어로 만들 수 있는 기회를 가질 수 있어요.\n`세상 모든 물건에 가치를, 소비를 지속 가능하게’ 라는 비전에 공감하며, 스트레스 없는 리커머스를 위한 솔루션을 끊임없이 함께 고민할 동료를 찾고 있어요.\n\n합류하면 함께 할 업무에요\nMSA 기반에서의 다양한 번개장터 서비스 컴포넌트를 개발해요.\n결제 시스템, 채팅 시스템 등 다양한 기능 컴포넌트를 개발해요.\n로깅 시스템, 검색 시스템, 광고 시스템 등 대용량 데이터 처리 기반의 서비스 컴포넌트를 개발해요.\n대량 트래픽을 안정적으로 감당할 수 있는 Architecture를 설계하고 개발 및 운영해요.\n\n이러한 경험을 할 수 있어요\n누적 가입자 2천만, DAU 100만 트래픽을 가진 중고거래 플랫폼에서 더 좋은 서비스와 가치를 만들어 나가는 경험을 쌓을 수 있어요.\n프로페셔널한 동료들과 데이터를 기반으로 치열하게 고민하며 함께 성장할 수 있어요.\n\n이러한 경험을 할 수 있어요\nMSA 기반에서의 다양한 번개장터 서비스 컴포넌트를 개발해요.\n결제 시스템, 채팅 시스템 등 다양한 기능 컴포넌트를 개발해요.\n로깅 시스템, 검색 시스템, 광고 시스템 등 대용량 데이터 처리 기반의 서비스 컴포넌트를 개발해요.\n대량 트래픽을 안정적으로 감당할 수 있는 Architecture를 설계하고 개발 및 운영해요.\n\n이런 분과 함께 하고 싶어요\n컴퓨터 공학 기반 지식을 보유하신 분 (자료구조, 알고리즘, 데이터베이스, 네트워크, 병렬처리, 소프트웨어 공학 등)\nJava/Kotlin 중 하나 이상 언어 사용이 능숙하신 분 (3년 이상의 경력이 있으신 분)\nUnix 혹은 Linux 계열 시스템에서의 개발 역량이 있으신 분\nMicro Service Architecture, RESTful, OOP, Design Pattern, Refactoring 등 다양한 소프트웨어 엔지니어링 프랙티스에 대한 이해와 경험이 있으신 분\n\n이런 경험이 있다면 더 좋아요\nSpring Framework에 대한 경험이 있으신 분\nEC2, RDS, S3, Kinesis, EKS 등 AWS 상에서의 개발 및 서비스 운영 경험이 있으신 분\nDocker 및 Kubernetes 를 활용한 개발 및 운영 경험이 있으신 분\nJIRA, Confluence, Slack, Git, Figma 등 협업도구 기반의 애자일 개발 경험이 있으신 분\nData-driven Thinking 기반으로 다양하고 복잡한 문제를 해결해본 경험이 있으신 분\nIT/커머스 업계 또는 스타트업 근무 경험을 보유하신 분\n\n합류 여정은 다음과 같아요\n서류 전형 > 1차 인터뷰 (라이브 코딩테스트 + 기술인터뷰) > 2차 인터뷰 > 최종 합격\n      ※ 2차 인터뷰 전형에서는 후보자 분의 동의를 받아 레퍼런스 체크가 진행될 수 있습니다.\n      ※ 전형 절차는 일정 및 상황에 따라 변경될 수 있어요.\n\n복지 패키지를 소개해요\n업무에 집중할 수 있는 환경과 다양한 라이프 베네핏을 받으며 근무할 수 있어요. (복지 패키지 보러 가기)\n\n지원 전 확인해주세요\n이력서는 자유 양식으로 지원해 주세요.\n번개장터는 지원자의 역량을 최우선적으로 검토하고 있어요. 이력서 제출 시 직무와 무관한 사항 (구직자 본인의 용모ㆍ키ㆍ체중 등의 신체적 조건, 구직자 본인의 출신지역ㆍ혼인여부ㆍ재산, 직계 존비속 및 형제자매의 학력ㆍ직업ㆍ재산 등)과 연봉 정보는 삭제 후 지원 부탁 드립니다.\n입사 후 적응을 위한 3개월의 수습기간이 있습니다.\n입사지원서 기재사항이 사실과 다를 경우 합격이 취소될 수 있습니다.\n국가유공자 및 장애인 등 취업보호대상자는 관계법령에 따라 우대합니다.\n지원자가 제출 서류에 대한 삭제를 요청할 경우 join@bunjang.co.kr로 문의하시면 지체 없이 제출 서류를 파기합니다."
}