{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45727846",
    "collection_date": "2024-11-23",
    "deadline": "상시채용",
    "search": "데이터 엔지니어",
    "company": "",
    "post title": "Software Engineer(Seoul)",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45727846?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=1284",
    "image": [],
    "text": "㈜스트라드비젼을 소개해요\n[About STRADVISION]\nWe Empower Everything To Perceive Intelligently\nSTRADVISION은 We Empower Everything to Perceive Intelligently 라는 미션을 가지고, AI기반의 카메라 인식기술로 모두의 더 나은 삶을 만들어가고 있습니다. 우리가 만든 소프트웨어가 모든 것을 빈틈없이 정확하게 인식하여, 세상의 올바른 의미를 전달할 수 있도록 현재 전 세계 8개 오피스, 300여명 규모 동료들과 Vision Perception AI 기술을 만들어가고 있습니다.\n더 나은 세상을 만들기 위한 VISION AI 기술, STRADVISION의 의미 있는 도전을 함께 만들어갈 동료를 찾습니다.\n\n[Our Story]\nㆍSTRADVISION 서울오피스 소개영상: 스트라드비젼 서울 강남 오피스를 소개합니다!\nㆍSTRADVISION Re-branding PR 홍보영상: 스트라드비젼 리브랜딩 PR 홍보영상\n[Our Technology]\nㆍ2019년, STRADVISION은 전 세계 딥러닝 기술 기반 스타트업 중 최초로 유럽 ASPICE CL2 인증을 획득하였고, 2020년에는 AVT ACES 자율주행 차량 혁신상을 수상하였습니다.\nㆍ또한, 글로벌 자율주행 기업들과 전문가들의 경연장인 AutoSens Award에서는 2년 연속(2021, 2022) ‘객체 인식 부문 최고상’(Gold Award Winner)을 수상하였습니다.\nㆍ2022년 8월, 1076억 규모로 마무리된 시리즈C 펀딩에는 미국의 Aptiv와 독일의 ZF Group이 전략적 투자자로 참여하여 STRADVISION의 우수한 기술력이 전 세계로부터 인정받았습니다.\nㆍ국내와 미국, 유럽, 일본 등에서 자율주행/ADAS 특허 167개 획득, STRADVISION은 차별화된 기술력 확보를 위해 오늘도 연구 개발을 적극적으로 하고 있습니다.\nㆍSTRADVISION Product 소개 페이지:\nhttps://stradvision.com/sv/en/product\n이런 업무를 해요\n[Mission of the Role]\nㆍSTRADVISION의 SW Toolchain Team(이하 STT)에서 유능한 Team member들과 Data Pipeline을 구성을 담당하실 전문가를 채용합니다. 지원 부서인STT에서는 STRADVISION 내부에서 개발에 필요한 Tool Chain을 제공하고 외부에서는 고객사에 전달되어 자사 솔루션의 평가 및 추가 기능 등을 제공하는 SW에 대한 개발 및 유지보수를 담당합니다.\nㆍSTT의 SW Engineer팀 멤버들과 함께 STT에서 구현하는 Data Pipeline 에서 Data의 수집, 변형, 보관, 관리, 제공을 구성하는 Component 들을 통합하고, Operation 자동화를 위한 스크립트 작성을담당합니다. Data Pipeline의 특성상 많은 Internal/External Customer와의 커뮤니케이션을 요구하게 되므로 Data Pipeline을 구성하기 위한 기술적인 지식뿐만 아니라 문서화와 커뮤니케이션 스킬 역시 필요합니다. 기존의 Data Pipeline을 개선하고 추가 기능을 구현하며 이를 관리하는 업무로 급변하는 Data Engineering의 기술동향에 맞추어 최신의 Data관련 기술적인 지식을 능동적으로 습득하는 업무 태도가 매우 중요합니다.\n\n[Key Responsibilities]\nㆍData Pipeline 관리: Kubernetes 기반으로 구성된 서버 클러스터를 모니터링하며 문제를 추적하고 해결합니다. 데이터 파이프라인에서 실행 중인 작업을 모니터링하여 소요 시간을 예측하고 병목 현상이 발생하는 지점을 최적화하기 위해 스크립트를 수정합니다. 데이터 파이프라인을 구성하는 각 컴포넌트의 인터페이스에 변경사항이 생기면 업데이트를 수행합니다.\nㆍData Pipeline 구축: 새로운 컴포넌트를 개발하거나 기존 작업과 다른 성격의 새로운 파이프라인을 구성합니다. 신규 파이프라인을 기술하기 위한 스크립트를 작성하고 샘플 데이터로 원하는 결과가 도출되는지 통합 테스트를 수행합니다. 모든 파이프라인은 자동화되어 효율성과 생산성을 극대화하기 위한 방향성을 가지고 구축됩니다. 이를 통해 프로젝트의 목표 달성과 리소스 최적화를 추구합니다.\nㆍData Center 유지 관리: 데이터 센터는 데이터 파이프라인에서 사용되는 모든 데이터가 저장되는 데이터 웨어하우스 역할을 하며, 필요한 각 단계별 인터페이스를 API 형태로 제공합니다. 데이터 파이프라인을 수정하거나 새로 구축할 때 필요한 경우 데이터 센터의 API를 업데이트하고 코드를 수정하여 배포합니다. 모든 데이터는 중앙화되어 관리되며, 불필요한 하드카피를 최소화하여 데이터의 무결성을 보장합니다. 사내 사용자에게는 사용성과 효율성을 고려한 GUI가 제공됩니다, 이를 통해 사내 멤버들이 데이터에 쉽고 효율적으로 접근할 수 있습니다.\n이런 분들을 찾고 있어요\nㆍ학력 : 학력무관\nㆍKubernetes 기반 서버 클러스터링에 대한 이해\nㆍPython,TypeScript를 능숙하게 다룰 수 있는 능력\nㆍDBMS에 대한 전반적인 이해\nㆍLinux 시스템에 대한 경험 및 이해\nㆍ원활한 커뮤니케이션 및 문서화 능력\nㆍ최소 5년 이상의 관련 실무 경험자\n이런 분이면 더 좋아요\nㆍKubernetes 및 Airflow에 대한 다양한 경험 및 깊은 이해\nㆍ클라우드(AWS, Azure 등) 환경에서의 프로젝트 경험 및 전반적인 이해\nㆍMongoDB에 대한 다양한 경험 및 깊은 이해\nㆍ비디오 데이터 또는 차량 데이터의 처리 및 관리 경험\nㆍLidar, Radar, CAN등 차량 Data에 대한 이해\nㆍ인공지능 학습의 Data ETL Process에 대한 이해\n\n\n[Application]\nㆍ필수: 국문 또는 영문 이력서 PDF 파일로 제출\nㆍ선택: 자기소개서/포트폴리오/논문\n\n\n[Recruitment Process]\nㆍ서류 전형 > SC Test 전형 > 리크루터 폰 스크리닝 > 면접 전형 > 평판조회(5년차 이상 해당) > 처우 협의 > 최종 합격\n(전형 절차는 직무별로 다르게 운영될 수 있으며, 일정 및 상황에 따라 변동될 수 있습니다.)\n\n\n[Others]\nㆍ전형 일정 및 결과는 지원서에 등록하신 이메일로 개별 안내드립니다.\nㆍ본 공고는 모집 완료 시 조기 마감될 수 있습니다.\nㆍ지원서 내용 중 허위사실이 있는 경우에는 합격이 취소될 수 있습니다.\n\nSTRADVISION은 한 사람 한 사람의 다양성을 존중하며, 한국오피스를 기반으로 해외오피스(독일, 미국, 일본, 중국) 멤버들과 글로벌 테크회사의 문화를 만들어가고 있습니다. 또한, STRADVISION은 채용전형에서 나이, 국적, 성별, 출신 등 업무역량과 관계없는 요소로 차별하지 않으며, 지원자 모두에게 공정한 기회를 제공합니다.\n이런 기술이 필요해요\nkubernetes\nPython\nTypeScript\nLinux\nDBMS\n이런 조건에서 근무할 예정이에요\nㆍ고용 형태 : 정규직\nㆍ근무지 주소 : 서울 서초구 강남대로 363 (서초동, 363강남타워)\n지도보기\nㆍ근무 요일/시간 : 주5일(월~금) 09:00 ~ 18:00\n합류 여정은 이렇게 진행돼요\nㆍ서류 전형 > SC Test 전형 > 리크루터 폰 스크리닝 > 면접 전형 > 평판조회(5년차 이상 해당) > 처우 협의 > 최종 합격\nㆍ면접일정은 추후 통보됩니다.\n이 기간동안 모집해요\n~ 2024. 11. 30 (토)\n지원 시 유의해주세요\n허위사실이 발견될 경우 채용이 취소될 수 있습니다."
}