{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45747320",
    "collection_date": "2024-11-23",
    "deadline": "2024-12-01",
    "search": "데이터 엔지니어",
    "company": "㈜트릿지",
    "post title": "㈜트릿지\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\nProduct Manager 채용 (5년 이상)",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45747320?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=1168",
    "image": [],
    "text": "Job Description\nAt Tridge, you will join a multicultural and diverse team of ambitious, caring, and results-driven individuals,\nall with one shared mission of empowering tomorrow. We currently have more than 300 employees working\nacross more than 70 countries, helping to pioneer and transform the global food supply chain through\ndata-driven solutions.\nPosition Summary\n새로운 비즈니스 기회를 발굴하고, 제품 이니셔티브를 수립하는 역할을 담당합니다. 사업 개발, 영업, 디자이너, 엔지니어 등\n유관 부서와 주도적으로 커뮤니케이션하며, 트릿지의 프로덕트 전략을 기획합니다. Cross Functional 팀과의 협업을 바탕으로\n데인터 기반 의사결정을 지원하며, 혁신적인 프로덕트 전략을 수립하고 실행할 수 있는 기회를 제공합니다.\n포지션 및 자격요건\nProduct Manager (5년 이상)\nKey\nResponsibilities\n제품 전략 수립 및 실행\n시장 조사, 경쟁사 분석, 고객 만족도 모니터링을 통해 제품 로드맵과 전략을 수립하고,\n이니셔티브를 제안하고 실행\n지표 분석 리드\n사용자 유입, 리텐션, 매출, 고객 만족도 등 전체 Funnel에 걸쳐 구체적이고 달성 가능한 지표를 분석하고\n의사결정을 지원\n제품 라이프사이클 관리\n제품 기획, 개발, 출시, 개선 단계를 포함한 전체 제품 라이프사이클을 관리하고, 시장의 요구에 맞추어 제품과 전략을 지속적으로 발전\n제품 개선 리드\n유저 피드백과 인사이트를 바탕으로 제품의 전반적인 사용성과 유저 만족도를 향상시키기 위해 지속적인\n개선을 주도\n이해 관계자 관리\n엔지니어, 프로덕트 디자이너, 데이터 분석가와 함께 프로젝트를 관리하고 전략을 도출\nQualifications\n5년 이상의 유관 경력 (PM, PO, 프로덕트 전략, 프로덕트 컨설팅 등)\nTridge 제품에 대한 관심과 이해도를 갖추신 분\n데이터 기반 의사 결정 능력 및 분석 능력을 갖추신 분\nGood to have,\nbut not must\nAmplitude, Google Analytics 등의 툴을 통한 지표 관리 경험\n유저 connection을 높이기 위한 프로덕트 개선 경험\nSQL 혹은 관련 데이터 분석을 통해 개선점을 발굴한 경험\nB2B 비즈니스에 대한 이해도\nWorking\nConditions\n채용형태 : 정규직(수습기간 3개월)\n근무시간 : 월 - 금, 09:00 - 19:00\n근무위치 : 서울특별시 서초구 방배로 226\n제출서류 : 이력서(필수), 경력기술서 및 추가 PR 자료(선택)\n전형절차\nSTEP.01\n서류전형\nSTEP.02\n과제전형\nSTEP.03\n면접전형\nSTEP.04\n최종합격\n* 면접일정은 추후 통보됩니다.\n기타사항\nIf you are a self-starter with a passion for making a difference, and if our core values resonate with you,\nwe encourage you to apply and become a part of our team. Apply Now!"
}