{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45826793",
    "collection_date": "2024-11-23",
    "deadline": "2024-11-28",
    "search": "데이터 엔지니어",
    "company": "한국애보트㈜",
    "post title": "한국애보트㈜\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\n[애보트메디칼코리아] EP Field Clinical Engineer(Sales Rep)",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45826793?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=1042",
    "image": [],
    "text": "[애보트메디칼코리아] \nEP Field Clinical Engineer(Sales Rep)\n한국애보트㈜는 자본금 309억 3,500만원, 매출액 2,088억 902만원, 사원수 261명 규모로 서울 강남구 대치동에 위치하고 있으며, 제약, 진단의학, 바스큘라, 당뇨사업을 하고 있습니다.\n포지션 및 자격요건\nField Clinical Engineer\n( ○명 )\nABOUT ABBOTT:\nAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.\nIn Abbott’s Electrophysiology (EP) business, we’re advancing the treatment of heart disease through breakthrough medical technologies in atrial fibrillation, allowing people to restore their health and get on with their lives. \n\nKEY PURPOSE OF ROLE:\nIntracardiac Echocardiography and EP case support and Sales \nKEY RESPONSIBILITIES:\nMaintain up to date clinical and technical, relevant to assigned Division, of current and new ABT therapies and technologies as well as a general understanding of the dynamics of the country healthcare market.\nProvide clinical support and assistance to the physicians with ABT equipment throughout the whole national territory\nAct as back-up to Marketing and Sales Manager for the monitoring and correct reporting of product incidents in line with ABT standard procedures.\nProvide operative support for product development programs when requested\nAnalyze the technical characteristics of competitors’ devices and contribute information to maintain the Marketing database\nPromote assigned ABT product lines and assist with market penetration & development and the establishment of new accounts by providing technical and professional.\nConduct product presentations and perform stand duty at exhibitions when requested, responding to technical questions that might be raised by customer.\nProvide training on the application of new products and clinical knowledge of intracardiac echocardiography and Electrophysiology to new physicians or other staffs as well\nAchieves sales target\nCollaborates with manager to implement agreed POA in line with marketing strategy\nIdentifies and establishes high quality customer relationships and internal collaboration\nWorks within agreed budgets\nQUALIFICATIONS: \nWorks systematically and logically to resolve problems, address opportunities or manage the situation at hand.\nDevelops and uses effective strategies to influence others or to gain their support.\nOral Communication / Presentation:  effectively transfers thoughts and express ideas verbally in individual or group situations internationally.\nPlanning and Organizing :  effectively identifies, plans, schedules and co-ordinates the resources (people, material, information, time) required to Accomplish your goals, is well prepared for every case ensuring they have the right stock and arrives on time.\nManages own commitments and time, works independently and autonomously across all accounts, completes administrative tasks (particularly the on line diary) accurately and in line with deadlines.\nEstablishing and maintaining a highly responsive relationship and effective communication with customers to ensure customer satisfaction.\nCompletion of knowing the electrophysiology inside out.\nCompletion of ABT product certification. Ensure all ABT standing Quality Procedures are followed and operate at all times in a way that maintains a positive perception of the ABT brand.\n\n\n전형절차\nㆍ서류전형 > 1차면접 > 2차면접 > 임원면접 > 최종합격\nㆍ면접일정은 추후 통보됩니다.\n\n유의사항\nㆍ허위사실이 발견될 경우 채용이 취소될 수 있습니다."
}