{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45837954",
    "collection_date": "2024-11-23",
    "deadline": "2024-12-30",
    "search": "데이터 엔지니어",
    "company": "㈜로드컴플릿",
    "post title": "㈜로드컴플릿\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\n[레전드오브슬라임] 서버 프로그래머",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45837954?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=765",
    "image": [],
    "text": "\"LOADCOMPLETE\" 은 \"좋은 게임을 만들기 위한 사람, 아이디어, 기술을 가득 채웠으니, 일좀 내볼까?\" 라는 의미로\n즐거운 모바일 콘텐츠를 만드는 글로벌 게임 전문 개발사 입니다.\n우리는 \"So we make jolly good games\"를 바탕으로 꾸준히 성장해 온 로드컴플릿은,\n보편적이면서, 독특한 재미와 Look&Feel, 소통하는 모바일 게임을 통해 전세계 게이머들에게 즐거움을 선사하고 있습니다.\n우리는 특별한 게임과 서비스를 만들며, 성장합니다.\n우리는 통통 튀는 창의력을 바탕으로 더 기억되는 경험을 만들기 위해, 다양한 도전을 하고 있습니다.\n아이디어를 현실로 바꿔줄 기술을 축적하고, 최신 기술이나 플랫폼의 기회에도 반응합니다.\n이러한 원칙을 기반으로 일상의 반짝임을 더할 콘텐츠를 만드는 \"LOADCOMPLETE\" 여정에 함께해 주세요.\nΙ 우리는 이렇게 일하고 있어요!\nCREATIVE\n      전 세계 게이머에게 인정받을 수 있는 창의적인 경험을 추구합니다.\nCALIBARTED\n      게임의 핵심과 차별화 포인트를 일찍 그리고 더 자주 검증합니다.\nCOST EFFECTIVE\n      물량보단 창발적 콘텐츠를, 그리고 개발 과정에서의 효율성을 추구합니다.\nΙ LOS 스튜디오를 소개해 드립니다!\nLOS스튜디오는 캐주얼 방치형 RPG '레전드 오브 슬라임'(레오슬)의 라이브 개발 및 서비스를 담당하며,\n변화하는 모바일 게임 트렌드를 따라 IP의 매력을 충분히 느낄 수 있는 게임을 서비스하는 개발 스튜디오입니다.\n우리와 함께 전 세계 게이머에게 다양한 즐거움을 드리고 싶다면 망설이지 말고 지원해 주세요!\nΙ 주요 업무\n합류 후 함께하실 업무에 대해서 소개해 드릴게요.\n고성능 및 고가용성이 보장되는 모바일 게임 서버 개발 및 유지보수 업무를 담당합니다.\n게임 내 콘텐츠 업데이트 및 신규 기능 개발을 위한 서버 로직 구현 업무를 담당합니다.\n멀티 플레이어 게임 서버의 아키텍쳐를 설계 및 구현합니다.\n서버 성능을 모니터링하고 최적화 작업을 진행합니다.\nΙ 지원 자격 \n아래의 경험을 해오셨던 분을 찾고 있어요.\n3년 이상의 게임 서버 개발 경험을 보유하신 분\nC#, .NET 등을 이용한 서버 프로그래밍에 능숙하신 분\n네트워크 프로토콜과 TCP/IP, HTTP 등의 기본적인 네트워크 지식을 보유하신 분\n데이터베이스 관리 및 최적화 경험을 보유하신 분 (SQL, NoSQL)\n해외 여행에 결격 사유가 없으신 분\nΙ 우대 사항 \n이런 경험이 있다면 더욱 좋습니다!\n자연계 석사 이상 학위를 보유하신 분\n클라우드 기반 서버 인프라(AWS 등)를 능숙하게 다루시는 분\n대용량 실시간 멀티 플레이어 게임 서버 운영 경험을 보유하신 분\n문제 해결 능력 및 효과적인 커뮤니케이션 스킬을 보유하신 분\n비동기 프로그래밍 및 멀티스레딩에 대한 깊은 이해도를 보유하신 분\nΙ 고용 형태\n정규직(수습기간 3개월)\nΙ 필수 제출 서류\n입사지원서(이력서 및 경력기술서), 포트폴리오\nΙ 전형 안내\n서류 전형 > 1차 실무 면접 > 과제 전형 > 2차 임원 면접 > 처우 협의 > 최종 합격\n과제 전형의 진행 여부와 부여 시점은 채용 상황에 따라 개별 결정되며, 대상자에 한해 별도 안내드릴 예정입니다.\n확인해주세요\n제출 서류에는 연봉 정보 제외 부탁드립니다.\n본 공고는 수시 모집으로 채용 완료 시 조기 마감될 수 있습니다.\n서류 전형 결과는 결과와 관계없이 모두 개별 안내 드립니다.\n지원서 내용 중 허위사실이 있는 경우 합격이 취소될 수 있습니다.\n채용 시 수집되는 개인정보의 처리 방침은 로드컴플릿 공식 채용 홈페이지 하단 '개인정보처리 방침' 부분 참고 부탁드립니다.\n채용 관련 문의는 카카오톡 채널 로드컴플릿 채용에서 물어보세요! :)"
}