{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45874697",
    "collection_date": "2024-11-23",
    "deadline": "2024-12-06",
    "search": "데이터 엔지니어",
    "company": "에스이에스에이아이코리아 유한회사",
    "post title": "에스이에스에이아이코리아 유한회사\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\nSenior Data Engineer",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45874697?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=713",
    "image": [],
    "text": "에스이에스에이아이코리아 유한회사\nSenior Data Engineer\n포지션 및 자격요건\nSenior Data Engineer \n( 1명 )\nRole Introduction\nㆍ SES is seeking a talented Senior Data Engineer to join our team. The successful candidate is committed and dedicated, \n     responsible, focused, detail-oriented, able to adjust in a fast-paced working environment, collaborate well with other staff \n     members with a shared vision and demonstrate excellent organizational communication skills.\n     Please submit English & Korean version CV in our job post.\n\nKey Responsibilities\nㆍIdentify data collection points for battery production lines and develop standardized templates to ensure consistency and \n    uniformity in data collection\nㆍResponsible for real-time data collection, preprocessing, and synchronous uploading of data from battery production \n     lines,  ensuring efficiency and stability in data transmission.\nㆍContinuously monitor and track the completeness and accuracy of data collection, promptly identify and resolve data \n    quality issues to ensure data reliability.\nㆍFamiliar with the infrastructure and processes of existing data lakehouse development. Assist line managers on data \n    analysis.\n\nRequired Qualifications\nㆍBA degree or higher\nㆍExperience in data related software development\nㆍLanguage: Korean (native) & English (working level)\nㆍat least 4-5 years of experience in data engineering or a related field\nㆍFamiliar with the basic concepts of data lakehouses and data modeling; actual experience in data lakehouse \n    development is preferred.\nㆍProficient in programming languages such as Python and SQL, with practical experience in data analysis and \n    processing  experience with big data is preferred.\nㆍFamiliarity and effective use of common relational databases, such as SQL Server and MySQL \nㆍAttention to detail, patience, strong communication skills, and the ability to effectively collaborate with cross-functional \n    teams \nㆍCandidates with experience in data collection and analysis for battery production lines are preferred.\n\nPlace of Work \nㆍUiwang, Gyeonggi Province \n\nBenefits \nㆍPerformance Bonuses & RSUs : Provided for regular employees\nㆍHousing Allowance or Mileage Support : Offered for employees residing outside the Chungju/Uiwang area\nㆍFlexible Working Hours : accordance to company policy\nㆍFull Salary during Probation : 100% of salary paid throughout the probation period\nㆍPaid Vacation : Provided in accordance with Korean labor laws (halfday/day)\nㆍSick & Bereavement Leave : Available per company policy\nㆍHoliday Gifts : Gift certificates for Lunar New Year and Thanksgiving\nㆍOn-Site Amenities : Pantry area, snacks, and lunch provided for on site employees, Wework space available for remote employees\n\n전형절차\nㆍ서류전형 > 1차면접 > 2차면접 > 임원면접 > 최종합격\nㆍ면접일정은 추후 통보됩니다.\n\n유의사항\nㆍ허위사실이 발견될 경우 채용이 취소될 수 있습니다."
}