{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45878440",
    "collection_date": "2024-11-23",
    "deadline": "2024-11-30",
    "search": "데이터 엔지니어",
    "company": "브랜드 인게이지먼트 네트워크 인크 (",
    "post title": "브랜드 인게이지먼트 네트워크 인크 (\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\nAI 개발자(AI Engineer/Full Stack Developer) 채용",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45878440?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=1292",
    "image": [],
    "text": "포지션 및 자격요건\nAI Engineer\n( ○명 )\n담당업무\n- 여러 도메인에 걸쳐 첨단 AI 모델을 개발하고 구현(이는 자연어 처리 (NLP), 자동 음성 인식 (ASR), 텍스트 음성 변환 (TTS), 컴퓨터 비전 (CV) 등을 포함합니다.)\n- 의도 감지, 감정 분석, 음성 합성, 이미지 인식 등 다양한 응용 프로그램을 위해 기계 학습 모델을 설계하고 적용하며 훈련.\n- 우리의 AI 시스템에서 성능 향상을 위해 LLMs 및 기타 기본 모델 (ASR, TTS 또는 CV)을 최적화하고 세밀하게 조정.\n- AI 능력을 강화하기 위해 외부 지식 출처를 통합.\n- AI 서비스를 위한 RESTful API를 개발하고 유지보수.\n- 다국적 및 다모드 AI 프로젝트에 참여.\n- 음성 합성에서 감정 표현 및 스피커 적응 및 구현.\n- 대표적인 학습 응용 프로그램과 전 세계 스타일 토큰 처리 개발.\n- 스피커 감지, 다중 스피커 인식 및 소음 제거 기능을 갖춘 ASR 시스템 개선.\n- Develop and implement advanced AI models across multiple domains, including Natural Language Processing (NLP), Automatic Speech Recognition (ASR), Text-to-Speech (TTS), and Computer Vision (CV)\n- Design, apply, and train machine learning models for various applications such as intent detection, sentiment analysis, speech synthesis, and image recognition.\n- Optimize and fine-tune LLMs and other base models (ASR, TTS or CV) used in our AI systems for improved performance \n- Incorporate external knowledge sources to enhance AI capabilities \n- Develop and maintain RESTful APIs for AI services \n- Work on multilingual and multi-modal AI projects \n- Implement emotion expression and speaker adaptation in speech synthesis \n- Develop representative learning applications and global style token processing \n- Enhance ASR systems with speaker detection, multi-speaker awareness, and denoising capabilities \n\n필요 자격 및 기술 \n- 다음 분야 중 적어도 하나에 대한 전문 지식: 자연어 처리 (NLP), 자동 음성 인식 (ASR), 텍스트 음성 변환 (TTS), 또는 컴퓨터 비전 \n- 여러 AI 도메인에서 학습하고 작업할 의지 \n- Python, C++, javascript 등 AI 개발 언어에 능숙함 \n- PyTorch, TensorFlow, ONNX 등 딥 러닝 프레임워크 경험 \n- Linux에서의 AI 개발 환경 근무 경험 \n- AI 관련 분야에서 2년 이상의 근무 경험 \n- Expertise in at least one of the following areas: Natural Language Processing (NLP), Automatic Speech Recognition (ASR), Text-to-Speech (TTS), or Computer Vision \n- Willingness to learn and work in multiple AI domains \n- Proficiency in AI development languages such as Python, C++, and javascript \n- Experience with deep learning frameworks like PyTorch, TensorFlow, and ONNX \n- Work experience in an AI development environment on Linux \n- More than 2 years of experience in AI-related fields \n\n우대사항\n- 상업용 자연어 처리 도구 및 모델 경험 (예: OpenAI API, Hugging Face) \n- 대형 언어 모델 및 기본 모델 프롬프트 및 작업 전문 지식 \n- 모델 최적화 기술에 대한 지식 \n- 컨테이너화 및 오케스트레이션 경험 (Docker, Kubernetes) \n- 네트워크 통신 프로토콜에 대한 익숙함 (WebSocket, gRPC, 메시지 큐) \n- Experience with commercial natural language processing tools and models (e.g., OpenAI API, Hugging Face) \n- Expertise in large language models and foundational model prompts and tasks \n- Knowledge of model optimization techniques \n- Experience with containerization and orchestration (Docker, Kubernetes) \n- Familiarity with network communication protocols (WebSocket, gRPC, message queues) \nFull Stack Developer\n( ○명 )\n담당업무\n- AI 모듈 기반 소프트웨어 front-end/back-end 개발\n- 기존 backend의 새로운 기능 개발 \n- 스택의 일부를 리팩터링하여 유지 관리 및 확장성 개선 \n- 팀원의 코드를 검토 및 요령 공유 \n- Developing AI module-based software front-end/back-end \n- Developing new features for an existing backend \n- Refactor parts of the stack to improve maintainability and scalability \n- Reviewing teammates` code and sharing tips and tricks \n\n필요 자격 및 기술 \n- Git 사용 경험 \n- 클라우드 시스템 (AWS, GCP, Microsoft)에 대한 이해와 경험 \n- Docker 사용 경험 \n- Python + gRPC 경험 \n- Python +Flask/FastAPI/Tornado 경험 \n- Python +WebSockets 경험 \n- DB (Postgres, MySql, mongoDB, CouchDB, Redis, memcached) 경험 \n- Experience using Git \n- Understanding and experience with crowd systems (AWS, GCP, Microsoft) \n- Experience with Docker \n- Experience with python + gRPC \n- Experience with python +Flask/FastAPI/Tornado \n- Experience with python +WebSockets \n- Experience with db (Postgres, MySql, mongoDB, CouchDB, Redis, memcached) \n\n우대사항\n- 4년 이상의 소프트웨어 프로그래밍 경험 (fullstack, front-end, back-end) \n- Python, javascript, Objective-C, PHP, C/C++, Ruby, C#, GO 개발 경험 \n- 4+ years of software programming experience (fullstack, front-end, back-end) \n- Experience with Python, javascript, Objective-C, PHP, C/C++, Ruby, C#, GO development \n\n전형절차\nㆍ서류전형 > 1차면접 > 2차면접 > 임원면접 > 최종합격\nㆍ면접일정은 추후 통보됩니다.\n\n유의사항\nㆍ허위사실이 발견될 경우 채용이 취소될 수 있습니다.\nㆍ제출서류: 영문 이력서 (필수)"
}