{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45938811",
    "collection_date": "2024-11-23",
    "deadline": "2024-12-15",
    "search": "데이터 엔지니어",
    "company": "에어리퀴드어드밴스드머티어리얼즈코리아",
    "post title": "에어리퀴드어드밴스드머티어리얼즈코리아\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\n[반도체 공정용 특수가스 생산 현장] 유지보수 엔지니어",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45938811?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=1224",
    "image": [],
    "text": "[반도체 공정용 특수가스 생산 현장] \n유지보수 엔지니어\n에어리퀴드어드밴스드머티어리얼즈코리아 는 2011년에 설립된 회사로  첨단 산업용 가스 및 특수 화학물질을 공급하며, 한국 반도체 및 전자 산업의 혁신과 성장을 지원하는 글로벌 선도 기업입니다. ALOHA™ 및 Voltaix® 제품을 통해 빅 데이터와 사물 인터넷에 필수적인 최신 컴퓨터 칩 제조를 지원하며, 디지털 분석 기술을 통해 업계 최고 수준의 품질 기준을 충족하고 있습니다. 또한, 연구(Lab)에서 대량 생산(Fab)까지 이어지는 실행을 강화하며, 고객과 함께 지속 가능한 미래를 향해 나아갑니다.\n포지션 및 자격요건\n유지보수 엔지니어\n( ○명 )\nJob Summary\nYou will support the maintenance strategy of production facilities in Air Liquide Advanced Materials (ALAM) based in the SJ plant. You will have a strong reliability focus and develop engineering solutions to decrease reactive maintenance and increase planned preventative maintenance.\n\n\nHow will you contribute and Grow?\n- Maintenance and improvement work in the process and utility machinery field\n- Preventive maintenance & corrective maintenance schedule and plan establishment\n- Implement engineering solutions.\n- Conduct RCA’s and FMEA’s and support PSM\n- Manage improvement projects\n- Perform Life Cycle Analysis\n- Implement Predictive Maintenance systems and support maintenance minimization efforts\n- Review and modify plans, procedure, material usage as needed\n- Develop reporting of maintenance activity, Key Performance Indicators (KPIs) and Metrics.\n- Manage CAPEX & OPEX budgets\n- Ensure compliance with HSES and Regulatory requirements\n\n자격요건\n- Bachelors of Science in Engineering or Engineering Technology with 5 years of Industrial Maintenance or Reliability experience in batch gas or chemical, heavy or high speed manufacturing industries.\n- Language:  Business Level in English\n\n전형절차\nㆍ서류전형 > 전화면접 >  1차면접 > 2차면접 > 급여책정 > 근로계약서 서> 최종합격\nㆍ면접일정은 추후 통보됩니다.\n\n유의사항\n「국가보훈 기본법」 제3조제2호에 따른 국가보훈대상자로서 국가보훈관계 법률에 따른 취업지원대상자는 관련법률에 의거하여 우대\n해외여행 결격사유가 없는자\n외국인의 경우 대한민국 내 취업활동을 할 수 있는 체류자격을 보유한 자 \n지원서의 기재사항이 사실과 다른 것으로 확인되거나 채용상의 결격사유가 확인될 경우 합격 또는 채용이 취소될 수 있습니다."
}