{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45955753",
    "collection_date": "2024-11-23",
    "deadline": "상시채용",
    "search": "데이터 엔지니어",
    "company": "",
    "post title": "Frontend Engineer(Seoul)",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45955753?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=1302",
    "image": [],
    "text": "㈜스트라드비젼을 소개해요\n[About STRADVISION]\nWe Empower Everything To Perceive Intelligently\nSTRADVISION은 We Empower Everything To Perceive Intelligently 라는 미션을 가지고, AI기반의 카메라 인식기술로 모두의 더 나은 삶을 만들어가고 있습니다. 우리가 만든 소프트웨어가 모든 것을 빈틈없이 정확하게 인식하여, 세상의 올바른 의미를 전달할 수 있도록 현재 전 세계 9개 오피스, 300명 이상의 동료들과 Vision Perception AI 기술을 만들어가고 있습니다.\n더 나은 세상을 만들기 위한 VISION AI 기술, STRADVISION의 의미 있는 도전을 함께 만들어갈 동료를 찾습니다.\n\n[Our Story]\nㆍSTRADVISION’s Latest Technology 영상: https://www.youtube.com/watch?v=wDPjUwim6mk&t=42s\nㆍSTRADVISION Re-branding PR 홍보영상: https://www.youtube.com/watch?v=fRnzeMJu4Yg\n[Our Technology]\nㆍ2019년, STRADVISION은 전 세계 딥러닝 기술 기반 스타트업 중 최초로 유럽 ASPICE CL2 인증을 획득하였고, 2020년에는 AVT ACES 자율주행 차량 혁신상을 수상하였습니다\nㆍ또한, 글로벌 자율주행 기업들과 전문가들의 경연장인 AutoSens Award에서는 2년 연속(2021, 2022) ‘객체 인식 부문 최고상’(Gold Award Winner)을 수상하였습니다.\nㆍ2022년 8월, 1076억 규모로 마무리된 시리즈C 펀딩에는 미국의 Aptiv와 독일의 ZF Group이 전략적 투자자로 참여하여 STRADVISION의 우수한 기술력이 전 세계로부터 인정받았습니다.\nㆍ국내와 미국, 유럽, 일본 등에서 자율주행/ADAS 특허 약 500여 개 획득, 710여 개를 출원 중이며, STRADVISION은 차별화된 기술력 확보를 위해 오늘도 연구 개발을 적극적으로 하고 있습니다.\nhttps://stradvision.com/sv/en/product\n이런 업무를 해요\n[Mission of the Role]\nㆍSTRADVISION의 SW Toolchain Team(이하 STT)에서 UX/UI의 기획과 구현을 담당하실 전문가를 채용합니다. 지원 부서인 STT에서는 STRADVISION 내부에서 개발에 필요한 Tool Chain을 제공하고 외부에서는 고객사에 전달되어 자사 솔루션의 평가 및 추가 기능 등을 제공하는 SW에 대한 개발 및 유지보수를 담당합니다.\nㆍSTT의 Frontend Engineer는 팀 멤버들과 함께 STT에서 구현하는 모든 Application과 Tool에 대한 UI/UX의 구현을 담당합니다. Backend, Data Pipeline, Data Collection등 다양한 파트와 협력하며 많은 수의 Internal/External Customer와 커뮤니케이션합니다. 주요 서비스는 Web 기반의 Labeling Tool 이며 Annotation Policy로부터 도출된 다양한 Requirement에 대응하기 위하여 Frontend 관련한 최신 기술 및 Web Dev. Process에 대한 대략적인 이해를 요구합니다. 주요 업무로는 Requirement 수집, UI/UX 기획, Frontend 구현 등이 있습니다.\n\n[Key Responsibilities]\nㆍLabeling Tool UI/UX 개발: 딥러닝 학습에 필요한 레이블 데이터를 생성하기 위해 다수의 사용자가 사용하는 라벨링 툴 어플리케이션의 UI/UX를 설계하고 구현합니다. 다양한 어노테이션 정책에 기반한 라벨링 요구사항을 분석하고 UI/UX 기획자와 협업합니다. 어노테이션 정책이 업데이트될 경우, 요구사항 명세를 작성하고 툴의 기능을 업데이트하여 배포합니다. Git 및 branch 전략을 활용하여 코드 관리를 체계적으로 수행합니다. 이를통해 개발 및 배포 프로세스의 효율성과 안정성을 보장합니다.\nㆍ코드관리 및 배포 프로세스 준수: Git 및 branch 전략을 활용하여 코드 관리를 체계적으로 수행합니다. 이를 통해 개발 및 배포 프로세스의 효율성과 안정성을 보장합니다.\nㆍData management service 개발: 데이터 매니저를 위해 데이터 배포, 작업된 결과의 수집, 그리고 각 데이터의 라벨링 상태를 추적할 수 있는 웹 기반의 데이터 관리 서비스를 개발합니다. 이 서비스를 통해 데이터 관리의 효율성과 정확성을 높이며, 전체 프로젝트의 진행 상황을 쉽게 모니터링할 수 있습니다.\nㆍData Pipeline UI/UX 개발: 데이터 수집, 가공, 저장, 관리, 제공의 각 단계를 자동화하여 연결하고 각 작업을 스케줄링 및 모니터링하기 위한 어플리케이션들을 개발합니다.\n\n[SV Frontend Tech Stack]\nㆍ주 프레임워크: Next.js\nㆍ프로그래밍 언어: TypeScript\nㆍ서버와의 통신: React-query 활용\nㆍ상태 관리: Zustand 사용\nㆍ스타일: Tailwind를 활용한 자체 디자인 컴포넌트 개발\nㆍ코드 관리: Turborepo를 통한 프론트엔드 모노레포 구성 및 trunk-based 브랜치 전략 활용\nㆍ개발 전략: 애자일 프로세스\n이런 분들을 찾고 있어요\nㆍ학력 : 학력무관\nㆍReact 혹은 Next.js 기반 프론트엔드 엔지니어링 경력 최소 2년 포함, 관련 경력 3년 이상의 관련 경험\nㆍJavaScript/TypeScript에 대한 기본적인 지식\nㆍREST API를 포함한 웹 서비스에 대한 전반적인 이해\nㆍ원활한 커뮤니케이션 및 문서화 능력\n이런 분이면 더 좋아요\nㆍThree.js 등 3차원 기반 라이브러리 사용 경험\nㆍCanvas, SVG 등 2차원 기반 라이브러리 활용 경험\nㆍE2E 테스트 구축 및 활용 경험\nㆍ모노레포 활용하여 개발 및 유지보수를 한 경험\nㆍ3D geometry 관련 이해: 다중 센서(카메라, 라이다, 차량 간)에 대한 호모그래피와 변환을 다뤄본 경험\nㆍ행렬 곱셈을 포함한 기본적인 선형대수의 구현 및 이해\n\n[Application]\nㆍ필수: 국문 또는 영문 이력서 PDF 파일로 제출\nㆍ선택: 자기소개서/포트폴리오/논문\n\n[Recruitment Process]\nㆍ서류 전형 > SC Test 전형 > 리크루터 폰 스크리닝 > 면접 전형 > 평판조회(5년차 이상 해당) > 처우 협의 > 최종 합격\n(전형 절차는 직무별로 다르게 운영될 수 있으며, 일정 및 상황에 따라 변동될 수 있습니다.)\n\n[Others]\nㆍ전형일정 및 결과는 지원서에 등록하신 이메일로 개별 안내드립니다.\nㆍ본 공고는 모집 완료 시 조기마감될 수 있습니다.\nㆍ지원서 내용 중 허위사실이 있는 경우에는 합격이 취소될 수 있습니다.\nSTRADVISION은 한 사람 한 사람의 다양성을 존중하며, 한국오피스를 기반으로 해외오피스(독일, 미국, 일본, 중국) 멤버들과 글로벌 테크회사의 문화를 만들어가고 있습니다. 또한, STRADVISION은 채용전형에서 나이, 국적, 성별, 출신 등 업무역량과 관계없는 요소로 차별하지 않으며, 지원자 모두에게 공정한 기회를 제공합니다.\n이런 기술이 필요해요\nJavascript\nReact\nRestAPI\nTypeScript\nNext.js\nREST API\n이런 조건에서 근무할 예정이에요\nㆍ고용 형태 : 정규직\nㆍ근무지 주소 : 서울 서초구 강남대로 363 (서초동, 363강남타워)\n지도보기\nㆍ근무 요일/시간 : 주5일(월~금) 09:00 ~ 18:00\n합류 여정은 이렇게 진행돼요\nㆍ서류 전형 > SC Test 전형 > Live Coding Test 전형 > 리크루터 폰 스크리닝 > 면접 전형 > 평판조회(5년차 이상 해당) > 처우 협의 > 최종 합격\nㆍ면접일정은 추후 통보됩니다.\n이 기간동안 모집해요\n~ 2024. 12. 18 (수)\n지원 시 유의해주세요\n허위사실이 발견될 경우 채용이 취소될 수 있습니다."
}