{
    "s3 url path": null,
    "site": "jobkorea",
    "id": "45970982",
    "collection_date": "2024-11-23",
    "deadline": "2024-12-14",
    "search": "데이터 엔지니어",
    "company": "하만커넥티드서비시즈인크",
    "post title": "하만커넥티드서비시즈인크\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\n하만커넥티드서비시즈인크 - Sr. Security Engineer (경력)",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45970982?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=1293",
    "image": [],
    "text": "하만커넥티드서비시즈인크 \nSr. Security Engineer(경력)\n하만커넥티드서비시즈인크는 2013년에 설립된 회사로 외국계(외국 법인기타)입니다. 성남시 분당구 야탑동에 위치하고 있으며, Solution Integration, Software Development사업을 하고 있습니다.\n포지션 및 자격요건\nSr. Security Engineer\n지원링크\n \n( ○명 )\nResponsibilities\nThe Security Engineer will provide support in the establishing of enterprise-wide security initiatives as required by various applications that compose our corporate and public network. They must have strong oral and written documentation and communication skills, to work with management, auditors and regulators concerning IT business controls and procedures. This position should bring prior analytical problem-solving skills, sound judgment, knowledge and expertise in all areas of IT Security. In addition, demonstrate a technical background and knowledge of system security processes, such as authentication practices, security administration and familiarity with industry standard hardware and software systems.\nArchitect, develop and document industry best practices to support company initiatives while meeting performance and availability requirements.\nCollaborate with Product, Operations and Engineering organizations to understand requirements and develop security specifications around project initiatives.\nResearch new security technologies and adopt suitable best practices to solve industry obstacles and security threats.\nProvide technical mentoring within the area of expertise and assist other security staff.\nEnsuring confidentiality, availability and integrity of cloud information systems and processes across the cloud infrastructure.\nAudit existing security standards: to include engineering designs, implementation, and guidelines.\nHandles operational problem escalations and vendor concerns related to security.\nDeploy and maintain internal security systems such as IDS/IPS, SIEM, WAF, FIM, DDOS, Threat Intel, SOAR and vulnerability scanners.\nWork with business colleagues to review RFPs, RFIs etc., and provide security and risk-related input into proposals.\nMonitor the external threat environment and information security trends while keeping business leadership informed about information security-related issues and activities potentially affecting the organization.\nServe as one of the information security subject matter experts for the Incident Response team and assist in escalations of any possible incidents impacting the company.\nProvide guidance on prioritization and remediation of security issues.\nSome travel may be required.\nQualifications and Requirements\nMinimum 8 to 10 years of experience as Security engineer.\nMust have a solid overall understanding of information technology and information security practices and trends.\nHands-on Public Cloud experience ? One or more of AWS, Azure, GCP -  desired but not required.\nProvide expertise and guidance to junior engineers in the deployment of security tools.\nPassionate about automation, performance, reliability, visibility, and finding creative solutions to complex security issues.\nMust be an intelligent, articulate and persuasive person who can serve as an effective member of the team and who is able to communicate security-related concepts to a broad range of technical and non-technical staff.\nUnderstanding of networking concepts such as BGP, VRF and MPLS.\nAbility to work with cross-functional, interdisciplinary teams to achieve tactical and strategic information security goals.\nExperience with security frameworks to include ISO, HIPAA, PCI, HITRUST and NIST\nExcellent written and verbal communication skills, interpersonal and collaborative skills, and the ability to communicate security and risk-related concepts to technical and nontechnical audiences.\nDemonstrable knowledge of cryptographic concepts and techniques, including encryption, hashing, and key management.\nKnowledge of Cloud-unique security risks, API security vulnerabilities and remediation measures.\nExperience with Kubernetes\nSolid understanding of network routers, switches and firewalls. Experience Juniper and Arista equipment preferred.\nWell versed in security hardening for Linux hosts, services, applications, web applications, and database applications.\nExperience using a scripting language for administration, monitoring and automation such as python and bash.\nProficient in Linux.\nExperience with ansible.\nExperience with open source tooling used to secure resources.\nStrong attention to detail, organizational skills, problem solving, troubleshooting and documentation skills.\nBilingual in Korean and English -\nDue to the nature of global infrastructure, flexibility on the working hours is required.\nCommuting to the Suwon office will be required weekly as this is a hybrid role. Ideally the candidate should live near Suwon.\nWhat We Offer (*This is subject to change)\nMedical Check-up (for employee and one dependent)\nGroup Life and Medical Insurance\nPension\nAnnual leave, Congratulatory & condolences leave\nMobile phone usage\nHARMAN Welcome Kit for new joiners\nBe-Brilliant (Harman own awards for employees)\nEmployee Entertainment\nLate commute and late meal allowance (Supporting late working employee)\nBreakfast service for early birds\nBenefit point (SK Benepia)\nSamsung Mall (Samsung and Harman product purchase)\nHoliday voucher for Lunar New Year and Chuseok\n\n전형절차\nㆍ서류전형 > 면접전형 > 최종합격\nㆍ면접일정은 추후 통보됩니다.\n\n유의사항\nㆍ허위사실이 발견될 경우 채용이 취소될 수 있습니다."
}