{
    "s3 url path": "test/45858430.json",
    "site": "jobkorea",
    "id": "45858430",
    "collection_date": "2024-11-22",
    "deadline": "2024-11-24",
    "search": "데이터 엔지니어",
    "company": "람다256",
    "post title": "람다256\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\n데이터 엔지니어",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45858430?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=17",
    "image": [],
    "text": "Introduction\n람다256은 전세계 최고의 디지털 자산 기술을 바탕으로 업비트를 운영하고 있는 두나무의 블록체인 기술 자회사입니다.\n람다256은 2019년 3월 두나무 블록체인 연구소에서 독립법인으로 분사 설립하여 아시아 No.1 블록체인 인프라 및 Web 3.0 개발 플랫폼인 '루니버스'(https://luniverse.io)를 개발 및 운영하고 있습니다. 또한 블록체인 기술 업체의 발굴과 육성, NFT와 STO 등을 통한 유무형 자산의 토큰화 및 이에 기반한 신규 사업 창출에 역량을 집중해 Web3 시대의 블록체인 기술 대중화에 앞장서고 있습니다.\n2021년 3월 시리즈A, 같은 해 12월 시리즈B 투자를 연속으로 유치하여 누적 투자액 1,055억 원을 달성하였고,\n‘2022 블록체인 진흥주간’에서 블록체인 부문 과학기술정보통신부 장관 표창을 수상하였습니다.\n2023년에는 퍼블릭 블록체인 인프라 서비스인 Luniverse NOVA를 런칭하여 NFT 사업 및 STO 플랫폼 구축 등\nWeb3 서비스 도입과 확장에 기여하고 있습니다.\n우리 일상의 디지털 인프라를 블록체인으로 업그레이드하는 미션에 관심 있으시다면 지금 바로 람다256에 지원해 주세요!\n  [람다256, 매출 100억 기록…\"웹3 인프라 기업으로 도약\"]\n[람다256, 2022 블록체인 진흥주간에서 과학기술정보통신부 장관 표창 수상]\n[두나무·하이브 NFT플랫폼 곧 등장, 탄소배출까지 낮춘 비결은]\n[람다256, 1055억원 투자 유치...하이브-와이지 참여]\n  데이터 플랫폼팀을 소개합니다\n 데이터 플랫폼팀은 람다256에서 운영하는 다양한 블록체인 데이터를 수집·처리·가공하여 데이터 서비스를 제공하는 업무를 담당하고 있습니다. 고객에게 필요한 데이터 기반 콘텐츠를 효과적으로 저장·처리하기 위해 블록체인 플랫폼을 운영하고 개발합니다. 나아가 데이터 기반의 서비스를 발굴하고자 PoC 등과 같은 다양한 시도와 도전을 거듭합니다. 데이터 플랫폼팀은 현재 Data Engineer로 구성되어 있으며, 서비스 제공을 위한 약간의 Backend 개발 업무도 함께 진행합니다. 주도적으로 업무 범위를 산정하고, 계획하며, 직접 서비스를 발굴/발전시키는 팀 문화를 지향하는 분이라면 지금 바로 지원해주세요.\n이런 일을 해요\n다양한 퍼블릭 블록체인의 데이터를 수집·가공하고 서비스 데이터 활용하기 위한 DW/Mart 테이블 설계\n데이터 파이프라인을 개발 및 운영\n실시간 블록체인 데이터를 빅데이터 플랫폼, 분산처리 기술 등을 활용해 효율적으로 처리하고, 이를 기반으로 Data Warehouse 구축\n쉽고 빠르게 분석할 수 있도록 효율적인 DW 구조를 설계하고, 자동화를 통해 안정적인 데이터 환경 구축\n배치, 실시간으로 처리되는 데이터 서비스의 발굴 및 개발·운영\n블록체인 Knowledge Graph 구축 및 관련 Job 개발\n주요 기술 스택\nKubernetes, AWS EKS\nSpark, Streaming frameworks\nTrino, Elasticsearch, NoSQL, Airflow\nAWS / GCP data services\n우린 이런 팀원을 원해요\n4년 이상의 유관 경력을 보유한 분\n블록체인에 대한 기본 지식 혹은 관심을 가지고 있는 분\n데이터 파이프라인에 대한 이해를 갖춘 분\n데이터 어플리케이션 개발을 위한 역량을 갖춘 분\n데이터 플랫폼 (인프라) 구축/운영 경험이 있는 분\n다양한 빅데이터 오픈소스의 구조를 이해하고 활용하는 것에 흥미가 있는 분\n이런 경험이 있다면 좋아요\n데이터 관련 다양한 도구를 운영해 본 경험\nCloud 환경에서의 업무 경험\n다양한 기술 언어, 기술 스택 환경에서도 거부감 없이 업무를 진행한 경험\n주도적으로 업무를 계획하고, 능동적으로 서비스 발전에 대해 고민한 경험\n데이터 플랫폼 조직이나 프로젝트를 리딩해본 경험\n제출 서류 및 연락처\n제출서류 : 이력서 및 자기소개서\n연락처 : recruit@lambda256.io"
}