{
    "s3 url path": "test/45875925.json",
    "site": "jobkorea",
    "id": "45875925",
    "collection_date": "2024-11-22",
    "deadline": "2024-12-06",
    "search": "데이터 엔지니어",
    "company": "암페놀커머셜인터커넥트코리아㈜",
    "post title": "암페놀커머셜인터커넥트코리아㈜\n기업인증 완료\n관심기업\n관심기업 추가하고 채용소식 받기\n닫기\nFAE (IT/DATA center: HS application)",
    "url": "https://www.jobkorea.co.kr/Recruit/GI_Read/45875925?Oem_Code=C1&logpath=1&stext=%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%97%94%EC%A7%80%EB%8B%88%EC%96%B4&listno=347",
    "image": [],
    "text": "Connector FAE - IT/HS Applications\n암페놀커머셜인터커넥트코리아㈜는 1997년에 설립된 회사로 자본금 5,000만원, 매출액 400억, 사원수 20명 규모의 중소기업입니다. 경기 수원시 권선구 고색동에 위치하고 있으며, 커넥터사업을 하고 있습니다.\n포지션 및 자격요건\n포지션\n( 1명 )\n\nIT, High Speed Application, (SSD) FAE`s role\n\nOur customer’s ultimate success depends on our ability to solve cutting edge problems in relation to IT, High Speed Application, (SSD) industries. We value our relationships with these companies, and we depend on our Sales and Field Applications Engineering Teams to foster this ongoing partnership.\nAs a Field Applications Engineer, he/she will interface with our customers, and internal product development, product marketing, and sales teams.\n\nResponsibilities\n\n1. Engineering resource on the sales team to lead technical aspects of the sales cycle.\n2. Provide technical marketing support for the development and implementation of ACP Group\n3. Prepare materials and participate in product presentations.\n4. Provide customer service to solve complex interconnect problems and technical inquiries.\n5. Help devise strategies to differentiate our products and solutions from our competitors.\n6. Collaborate with local/group/customers to meet and exceed strategic objectives (create New Business Opportunity & achieve Design Win)\n7. Lead connector promotion and development (manage BU, factory), customer approval, and quality controll.\n8. Collaborate with BU and factories at overseas locations to support customer needs.\n\nIT, High Speed Application, (SSD) 커넥터 제품 판매 동향에 대해 추진력 있는 기술력을 영업에 제공할 수 있는 엔지니어링 리소스\n암페놀 커머셜 그룹의 제품 개발과 구현 및 기술 지원\n제품의 기술 자료를 준비하여 고객사 회의 시 프리젠테이션\n고객과의 커뮤니케이션: 다양하고 난이도 높은 제품에서 발생하는 기술 문제를 해결하는 의사소통 능력\n암페놀의 제품과 솔루션을 팀워크를 바탕으로 경쟁 업체와 차별화된 전략을 수립\n한국, 암페놀 그룹, 고객사들과의 협업으로 전략적 목표에 달성 (신규비즈니스 창출과 디자인 윈 달성)\n커넥터 프로모션, 개발 (*공장 Lead), 고객 승인, 품질관리 활동 \n해외 거점의 BU, 공장과 협업을 통해서 고객사 대응\n\nQualifications\n\n1. Bachelor’s degree in engineering field or equivalent (in Mechanical or Electrical/Electronic Engineering)\n2. 5+ years’ experience in design or applications engineering of electrical hardware components/ interconnect solutions industry.\n3. Displayed experience providing product marketing and sales technical support to produce design wins.\n4. Prefer experienced in modeling tool: CAD or Solidworks and MS office package.\n5. Upper Intermediate in English; ability to communicate in written and verbal English.\n6. High level customer service and ability to build relationships with customers.\n7. Strong organization and presentation skills \n8. Language: English (intermidieate) + optional: Chinese\n\nBackground: 학사 (전자, 전기, 통신 전공자)\nCareer: 5년 이상 커넥터 분야의 전자, 전기 부품 설계 또는 FAE 유경험자\nKnow-how: 제품의 마켓팅, 기술영업을 지원하여 디자인 윈 성공 케이스 \nTool: CAD/Solidworks 사용 가능자\nRelationship: 높은 수준의 고객 지원과 관계를 구축할 수 있는 능력\nSkill: 프리젠테이션 능력\nLanguage: 영어회화 가능자 (+옵션: 중국어) \n\nBenefit: 성과에 따른 인센티브, 가족복지금, 시차출근제\nLocation: 경기도 수원\nGender: 무관\n\n전형절차\nㆍ서류전형 > 1차면접 > 2차면접 > 임원면접 > 최종합격\nㆍ면접일정은 추후 통보됩니다.\n\n유의사항\nㆍ허위사실이 발견될 경우 채용이 취소될 수 있습니다."
}